#### Terraform Plan 📖

```
[command]/home/runner/work/_temp/9d90633f-ecf8-4115-9df5-e34c978a1282/terraform-bin -chdir=deploy/infra show -no-color tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # digitalocean_droplet.app must be replaced
-/+ resource "digitalocean_droplet" "app" {
      ~ created_at           = "2025-09-21T23:45:43Z" -> (known after apply)
      ~ disk                 = 80 -> (known after apply)
      ~ id                   = "520048519" -> (known after apply)
      ~ image                = "ubuntu-22-04-x64" -> "ubuntu-23-10-x64" # forces replacement
      ~ ipv4_address         = "167.172.250.79" -> (known after apply)
      ~ ipv4_address_private = "10.10.0.2" -> (known after apply)
      ~ ipv6_address         = "" -> (known after apply)
      ~ locked               = false -> (known after apply)
      ~ memory               = 4096 -> (known after apply)
        name                 = "asset-archive-dev-app"
      ~ price_hourly         = 0.03571 -> (known after apply)
      ~ price_monthly        = 24 -> (known after apply)
      ~ private_networking   = true -> (known after apply)
      ~ status               = "active" -> (known after apply)
        tags                 = [
            "environment:dev",
            "project:asset-archive",
            "role:app",
            "terraform:true",
            "test-tag:workflow-test",
        ]
      ~ urn                  = "do:droplet:520048519" -> (known after apply)
      ~ vcpus                = 2 -> (known after apply)
      ~ volume_ids           = [] -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # digitalocean_project_resources.main will be updated in-place
  ~ resource "digitalocean_project_resources" "main" {
        id        = "d2c0a376-79b7-4091-a1fa-0c82bca6a82a"
      ~ resources = [
          - "do:droplet:520048519",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # null_resource.container_update is tainted, so must be replaced
-/+ resource "null_resource" "container_update" {
      ~ id       = "2484588366350030071" -> (known after apply)
      ~ triggers = {
          ~ "droplet_id"     = "520048519" -> (known after apply)
            # (2 unchanged elements hidden)
        }
    }

Plan: 2 to add, 1 to change, 2 to destroy.

Changes to Outputs:
  ~ cms_admin_url                = "http://167.172.250.79:1337/admin" -> (known after apply)
  ~ cms_url                      = "http://167.172.250.79:1337" -> (known after apply)
  ~ droplet_id                   = "520048519" -> (known after apply)
  ~ droplet_ipv4_address         = "167.172.250.79" -> (known after apply)
  ~ droplet_ipv4_address_private = "10.10.0.2" -> (known after apply)
  ~ frontend_url                 = "http://167.172.250.79:3000" -> (known after apply)
  ~ ssh_connection               = "ssh root@167.172.250.79" -> (known after apply)
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  ~ update in-place%0A-/+ destroy and then create replacement%0A%0ATerraform will perform the following actions:%0A%0A  # digitalocean_droplet.app must be replaced%0A-/+ resource "digitalocean_droplet" "app" {%0A      ~ created_at           = "2025-09-21T23:45:43Z" -> (known after apply)%0A      ~ disk                 = 80 -> (known after apply)%0A      ~ id                   = "520048519" -> (known after apply)%0A      ~ image                = "ubuntu-22-04-x64" -> "ubuntu-23-10-x64" # forces replacement%0A      ~ ipv4_address         = "167.172.250.79" -> (known after apply)%0A      ~ ipv4_address_private = "10.10.0.2" -> (known after apply)%0A      ~ ipv6_address         = "" -> (known after apply)%0A      ~ locked               = false -> (known after apply)%0A      ~ memory               = 4096 -> (known after apply)%0A        name                 = "asset-archive-dev-app"%0A      ~ price_hourly         = 0.03571 -> (known after apply)%0A      ~ price_monthly        = 24 -> (known after apply)%0A      ~ private_networking   = true -> (known after apply)%0A      ~ status               = "active" -> (known after apply)%0A        tags                 = [%0A            "environment:dev",%0A            "project:asset-archive",%0A            "role:app",%0A            "terraform:true",%0A            "test-tag:workflow-test",%0A        ]%0A      ~ urn                  = "do:droplet:520048519" -> (known after apply)%0A      ~ vcpus                = 2 -> (known after apply)%0A      ~ volume_ids           = [] -> (known after apply)%0A        # (10 unchanged attributes hidden)%0A    }%0A%0A  # digitalocean_project_resources.main will be updated in-place%0A  ~ resource "digitalocean_project_resources" "main" {%0A        id        = "d2c0a376-79b7-4091-a1fa-0c82bca6a82a"%0A      ~ resources = [%0A          - "do:droplet:520048519",%0A        ] -> (known after apply)%0A        # (1 unchanged attribute hidden)%0A    }%0A%0A  # null_resource.container_update is tainted, so must be replaced%0A-/+ resource "null_resource" "container_update" {%0A      ~ id       = "2484588366350030071" -> (known after apply)%0A      ~ triggers = {%0A          ~ "droplet_id"     = "520048519" -> (known after apply)%0A            # (2 unchanged elements hidden)%0A        }%0A    }%0A%0APlan: 2 to add, 1 to change, 2 to destroy.%0A%0AChanges to Outputs:%0A  ~ cms_admin_url                = "http://167.172.250.79:1337/admin" -> (known after apply)%0A  ~ cms_url                      = "http://167.172.250.79:1337" -> (known after apply)%0A  ~ droplet_id                   = "520048519" -> (known after apply)%0A  ~ droplet_ipv4_address         = "167.172.250.79" -> (known after apply)%0A  ~ droplet_ipv4_address_private = "10.10.0.2" -> (known after apply)%0A  ~ frontend_url                 = "http://167.172.250.79:3000" -> (known after apply)%0A  ~ ssh_connection               = "ssh root@167.172.250.79" -> (known after apply)%0A
::debug::stderr: 
::debug::exitcode: 0

```
*Pushed by: @davidb-onchain, Action: `pull_request`*